In [1]:
import pandas as pd

In [2]:
# Read the dataset

In [3]:
df = pd.read_csv('Data_cleaning_with_pandas.csv')

In [4]:
# Check some basic information, to get a glance at the data

In [5]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB

In [7]:
df.describe()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,10000,9667,9862,9821,9827,7421,6735,9841
unique,10000,10,7,8,19,5,4,367
top,TXN_1961373,Juice,5,3.0,6.0,Digital Wallet,Takeaway,UNKNOWN
freq,1,1171,2013,2429,979,2291,3022,159

In [8]:
# Search for the null data

In [9]:
df.isnull().sum()

Transaction ID         0
Item                 333
Quantity             138
Price Per Unit       179
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

In [10]:
# Starting to change the data types, while cleaning the dataset

In [11]:
df['Transaction ID'] = df['Transaction ID'].astype('string')

In [12]:
# Since 'Item' is not an arithmetic column, I will not erase the mistakes; I will simply leave them as 'Missing Value'

In [13]:
df.loc[:, 'Item'] = df['Item'].replace(['ERROR', 'UNKNOWN', 'nan'], pd.NA)

In [14]:
df.loc[:, 'Item'] = df['Item'].replace({float('nan'): pd.NA})

In [15]:
df.loc[:, 'Item'] = df['Item'].fillna('Missing Value')

In [16]:
print(df['Item'].unique())

['Coffee' 'Cake' 'Cookie' 'Salad' 'Smoothie' 'Missing Value' 'Sandwich'
 'Juice' 'Tea']

In [17]:
df['Item'] = df['Item'].astype('string')

In [18]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  string
 1   Item              10000 non-null  string
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(6), string(2)
memory usage: 625.1+ KB

Transaction ID         0
Item                   0
Quantity             138
Price Per Unit       179
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

In [19]:
# Since 'Quantity is an arithmetic column, I will get rid of the lines that have mistakes; I want these columns as clean as possible.
# I will work the same way for the rest of the arithmetic columns (Price Per Unit, Total Spent).

In [20]:
df['Quantity'] = df['Quantity'].replace(['ERROR', 'UNKNOWN', 'nan'], pd.NA)

In [21]:
df['Quantity'] = pd.to_numeric(df['Quantity'], errors='coerce')

In [22]:
df = df.dropna(subset=['Quantity'])

In [23]:
df.loc[:, 'Quantity'] = df['Quantity'].astype(int)

In [24]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 9521 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9521 non-null   string
 1   Item              9521 non-null   string
 2   Quantity          9521 non-null   float64
 3   Price Per Unit    9349 non-null   object
 4   Total Spent       9353 non-null   object
 5   Payment Method    7074 non-null   object
 6   Location          6412 non-null   object
 7   Transaction Date  9371 non-null   object
dtypes: float64(1), object(5), string(2)
memory usage: 669.4+ KB

Transaction ID         0
Item                   0
Quantity               0
Price Per Unit       172
Total Spent          168
Payment Method      2447
Location            3109
Transaction Date     150
dtype: int64

In [25]:
df.loc[:, 'Price Per Unit'] = df['Price Per Unit'].replace(['ERROR', 'UNKNOWN', 'nan', '', None], pd.NA)

In [26]:
df.loc[:, 'Price Per Unit'] = pd.to_numeric(df['Price Per Unit'], errors='coerce')

In [27]:
df = df.dropna(subset=['Price Per Unit'])

In [28]:
df.loc[:, 'Price Per Unit'] = df['Price Per Unit'].astype(float)

In [29]:
df['Price Per Unit'] = df['Price Per Unit'].astype(float)

In [30]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 9006 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9006 non-null   string
 1   Item              9006 non-null   string
 2   Quantity          9006 non-null   float64
 3   Price Per Unit    9006 non-null   float64
 4   Total Spent       8843 non-null   object
 5   Payment Method    6696 non-null   object
 6   Location          6065 non-null   object
 7   Transaction Date  8869 non-null   object
dtypes: float64(2), object(4), string(2)
memory usage: 633.2+ KB

Transaction ID         0
Item                   0
Quantity               0
Price Per Unit         0
Total Spent          163
Payment Method      2310
Location            2941
Transaction Date     137
dtype: int64

In [31]:
df.loc[:, 'Total Spent'] = df['Total Spent'].replace(['ERROR', 'UNKNOWN', 'nan', '', None], pd.NA)

In [32]:
df['Total Spent'].unique()

array(['4.0', '12.0', <NA>, '10.0', '20.0', '9.0', '16.0', '15.0', '25.0',
       '8.0', '5.0', '3.0', '6.0', '2.0', '1.0', '7.5', '1.5', '4.5'],
      dtype=object)

In [33]:
df.loc[:, 'Total Spent'] = pd.to_numeric(df['Total Spent'], errors='coerce')

In [34]:
df = df.dropna(subset=['Total Spent'])

In [35]:
df['Total Spent'] = df['Total Spent'].astype(float)

In [36]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 8544 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8544 non-null   string
 1   Item              8544 non-null   string
 2   Quantity          8544 non-null   float64
 3   Price Per Unit    8544 non-null   float64
 4   Total Spent       8544 non-null   float64
 5   Payment Method    6354 non-null   object
 6   Location          5762 non-null   object
 7   Transaction Date  8415 non-null   object
dtypes: float64(3), object(3), string(2)
memory usage: 600.8+ KB

Transaction ID         0
Item                   0
Quantity               0
Price Per Unit         0
Total Spent            0
Payment Method      2190
Location            2782
Transaction Date     129
dtype: int64

In [37]:
# Again, non arithmetic columns, so I leave 'Missing Value' where there were mistakes or null.

In [38]:
df['Payment Method'] = df['Payment Method'].replace(['ERROR', 'UNKNOWN', 'nan', pd.NA], 'Missing Value')

In [39]:
df['Payment Method'] = df['Payment Method'].fillna('Missing Value')

In [40]:
df['Payment Method'] = df['Payment Method'].astype('string')

In [41]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 8544 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8544 non-null   string
 1   Item              8544 non-null   string
 2   Quantity          8544 non-null   float64
 3   Price Per Unit    8544 non-null   float64
 4   Total Spent       8544 non-null   float64
 5   Payment Method    8544 non-null   string
 6   Location          5762 non-null   object
 7   Transaction Date  8415 non-null   object
dtypes: float64(3), object(2), string(3)
memory usage: 600.8+ KB

Transaction ID         0
Item                   0
Quantity               0
Price Per Unit         0
Total Spent            0
Payment Method         0
Location            2782
Transaction Date     129
dtype: int64

In [42]:
df['Location'] = df['Location'].replace(['ERROR', 'UNKNOWN', 'nan', pd.NA], 'Missing Value')

In [43]:
df['Location'] = df['Location'].astype('string')

In [44]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 8544 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8544 non-null   string
 1   Item              8544 non-null   string
 2   Quantity          8544 non-null   float64
 3   Price Per Unit    8544 non-null   float64
 4   Total Spent       8544 non-null   float64
 5   Payment Method    8544 non-null   string
 6   Location          8544 non-null   string
 7   Transaction Date  8415 non-null   object
dtypes: float64(3), object(1), string(4)
memory usage: 600.8+ KB

Transaction ID        0
Item                  0
Quantity              0
Price Per Unit        0
Total Spent           0
Payment Method        0
Location              0
Transaction Date    129
dtype: int64

In [45]:
# Here there is a date column. So, besides altering the dtype, I will also erase the lines with mistakes, because I want it 
# as clean as possible.

In [46]:
df['Transaction Date'] = df['Transaction Date'].replace(['', 'n/a', 'N/A'], pd.NA)

In [47]:
df['Transaction Date'] = pd.to_datetime(df['Transaction Date'], format='%Y-%m-%d', errors='coerce')

In [48]:
df = df.dropna(subset=['Transaction Date'])

In [49]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 8159 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8159 non-null   string
 1   Item              8159 non-null   string
 2   Quantity          8159 non-null   float64
 3   Price Per Unit    8159 non-null   float64
 4   Total Spent       8159 non-null   float64
 5   Payment Method    8159 non-null   string
 6   Location          8159 non-null   string
 7   Transaction Date  8159 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(3), string(4)
memory usage: 573.7 KB

Transaction ID      0
Item                0
Quantity            0
Price Per Unit      0
Total Spent         0
Payment Method      0
Location            0
Transaction Date    0
dtype: int64